coll.json

{"item":[{"id":"145c61e9-e813-432f-b22d-d3cde5f641e6","name":"CalculatorSoap","item":[{"id":"e1ec74e2-7b26-4e4a-bec9-b248f984b63a","name":"Add","description":{"content":"Adds two integers. This is a test WebService. ©DNE Online","type":"text/plain"},"request":{"url":{"host":["{{url_variable_0}}calculator","asmx"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Add>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"58ee350a-c213-4c97-8de4-29e277a1f2bb","name":"Add response","originalRequest":{"url":{"protocol":"http","path":["calculator.asmx"],"host":["www","dneonline","com"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Add>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <AddResponse xmlns=\"http://tempuri.org/\">\n      <AddResult>-2147483648</AddResult>\n    </AddResponse>\n  </soap:Body>\n</soap:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"c5831bf6-89a5-40af-8421-e810e9ec8bff","name":"Subtract","description":{"content":"","type":"text/plain"},"request":{"url":{"host":["{{url_variable_0}}calculator","asmx"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Subtract xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Subtract>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"e4d971ab-a01d-49f0-be8f-bd43d0ee94bb","name":"Subtract response","originalRequest":{"url":{"protocol":"http","path":["calculator.asmx"],"host":["www","dneonline","com"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Subtract xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Subtract>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <SubtractResponse xmlns=\"http://tempuri.org/\">\n      <SubtractResult>-2147483648</SubtractResult>\n    </SubtractResponse>\n  </soap:Body>\n</soap:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"c9daf2ac-013e-4a9e-92f4-360051cf8b42","name":"Multiply","description":{"content":"","type":"text/plain"},"request":{"url":{"host":["{{url_variable_0}}calculator","asmx"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Multiply xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Multiply>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"772ea7bc-3749-4e3c-a824-b0ac1d589a20","name":"Multiply response","originalRequest":{"url":{"protocol":"http","path":["calculator.asmx"],"host":["www","dneonline","com"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Multiply xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Multiply>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <MultiplyResponse xmlns=\"http://tempuri.org/\">\n      <MultiplyResult>-2147483648</MultiplyResult>\n    </MultiplyResponse>\n  </soap:Body>\n</soap:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"cd6627d6-aac1-43ab-b0db-dd653f3815be","name":"Divide","description":{"content":"","type":"text/plain"},"request":{"url":{"host":["{{url_variable_0}}calculator","asmx"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Divide xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Divide>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"9408d557-ee2d-4a16-bae5-2e9c413472a9","name":"Divide response","originalRequest":{"url":{"protocol":"http","path":["calculator.asmx"],"host":["www","dneonline","com"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <Divide xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Divide>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <DivideResponse xmlns=\"http://tempuri.org/\">\n      <DivideResult>-2147483648</DivideResult>\n    </DivideResponse>\n  </soap:Body>\n</soap:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]}],"event":[]},{"id":"116a0e8e-8221-4c32-ba6d-b4161c944f9e","name":"CalculatorSoap12","item":[{"id":"31b6e82c-4671-4e76-b2ec-0f96085bb7c1","name":"Add","description":{"content":"Adds two integers. This is a test WebService. ©DNE Online","type":"text/plain"},"request":{"url":{"host":["{{url_variable_0}}calculator","asmx"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Add>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"5d4b1612-8864-4653-9054-ea790a2364d8","name":"Add response","originalRequest":{"url":{"protocol":"http","path":["calculator.asmx"],"host":["www","dneonline","com"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Add xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Add>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <AddResponse xmlns=\"http://tempuri.org/\">\n      <AddResult>-2147483648</AddResult>\n    </AddResponse>\n  </soap12:Body>\n</soap12:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"ca0782e4-bae7-4f30-944a-984712985561","name":"Subtract","description":{"content":"","type":"text/plain"},"request":{"url":{"host":["{{url_variable_0}}calculator","asmx"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Subtract xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Subtract>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"e32438f0-b4f7-4d64-96df-41196e428944","name":"Subtract response","originalRequest":{"url":{"protocol":"http","path":["calculator.asmx"],"host":["www","dneonline","com"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Subtract xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Subtract>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <SubtractResponse xmlns=\"http://tempuri.org/\">\n      <SubtractResult>-2147483648</SubtractResult>\n    </SubtractResponse>\n  </soap12:Body>\n</soap12:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"14448e19-ec05-49c7-bc48-3636801caeb7","name":"Multiply","description":{"content":"","type":"text/plain"},"request":{"url":{"host":["{{url_variable_0}}calculator","asmx"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Multiply xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Multiply>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"0f5e34ed-7ee4-48e1-a1ea-9fee82036d8b","name":"Multiply response","originalRequest":{"url":{"protocol":"http","path":["calculator.asmx"],"host":["www","dneonline","com"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Multiply xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Multiply>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <MultiplyResponse xmlns=\"http://tempuri.org/\">\n      <MultiplyResult>-2147483648</MultiplyResult>\n    </MultiplyResponse>\n  </soap12:Body>\n</soap12:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]},{"id":"caff0fe2-ecbf-4e0f-a427-075c267fc9e1","name":"Divide","description":{"content":"","type":"text/plain"},"request":{"url":{"host":["{{url_variable_0}}calculator","asmx"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Divide xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Divide>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"response":[{"id":"76fc16ec-7d73-4bb5-aa68-cb20061c782f","name":"Divide response","originalRequest":{"url":{"protocol":"http","path":["calculator.asmx"],"host":["www","dneonline","com"],"query":[],"variable":[]},"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"method":"POST","body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <Divide xmlns=\"http://tempuri.org/\">\n      <intA>-2147483648</intA>\n      <intB>-2147483648</intB>\n    </Divide>\n  </soap12:Body>\n</soap12:Envelope>\n","options":{"raw":{"language":"xml"}}}},"status":"OK","code":200,"header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <DivideResponse xmlns=\"http://tempuri.org/\">\n      <DivideResult>-2147483648</DivideResult>\n    </DivideResponse>\n  </soap12:Body>\n</soap12:Envelope>\n","cookie":[],"_postman_previewlanguage":"xml"}],"event":[]}],"event":[]}],"event":[],"variable":[{"type":"any","value":"http://www.dneonline.com/","key":"url_variable_0"}],"info":{"_postman_id":"7b66b2d6-18e4-4eca-92e2-6ba4d5018780","name":"Find the way to get the name of the collection.","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json"}}